<?xml version="1.0" encoding="utf-8"?>
<net version="1.0" name="mobile-v2-compact-yolov3">
	<input>
		<data_order>NCHW</data_order>
		<data_type>FP32</data_type>
		<channels>3</channels>
		<height>416</height>
		<width>416</width>
	</input>	
	<classes>
		<class>areca</class>		
	</classes> 
	<anchors style="yolo">
		<anchor width="23" height="23" />
        <anchor width="35" height="36" />
        <anchor width="48" height="49" />
        <anchor width="64" height="66" />
        <anchor width="90" height="91" />
        <anchor width="147" height="157" />
	</anchors>
	<layers>
		<layer id="conv2d-1" desc="output: 208*208*32, stride=2">
			<module id="convolution" type="conv"  filters="32" size="3" stride="2" />
			<module id="normalization" type="batch-norm" />
			<module id="activation" type="activation" method="leaky" />
		</layer>
		<layer id="bottleneck-2-1" desc="output:104*104*32, bottleneck-2(1/2), t=6, stride=2" >
			<!--1x1+leaky-->
			<module id="conv1x1" type="conv"  filters="96" />			
			<module id="norm1" type="batch-norm" />
			<module id="leaky.1" type="activation" method="leaky" />
			<!--3x3dw+leaky-->
			<module id="conv3x3dw" type="conv"  filters="96" size="3" group="96" stride="2" />
			<module id="norm2" type="batch-norm" />
			<module id="leaky.2" type="activation" method="leaky" />
			<!--1x1-->
			<module id="conv-transform" type="conv"  filters="32" />			
			<module id="norm3" type="batch-norm" /> 
		</layer>
		<layer id="bottleneck-2-2" desc="output:104*104*32, bottleneck-2(2/2), t=6, stride=1" >
			<!--1x1+leaky-->
			<module id="conv1x1" type="conv"  filters="192" />			
			<module id="norm1" type="batch-norm"  />
			<module id="leaky.1" type="activation" method="leaky"  />
			<!--3x3dw+leaky-->
			<module id="conv3x3dw" type="conv"  filters="192" size="3" group="192" />
			<module id="norm2" type="batch-norm"  />
			<module id="leaky.2" type="activation" method="leaky"  />
			<!--1x1-->
			<module id="conv-transform" type="conv"  filters="32" />			
			<module id="norm3" type="batch-norm"  /> 
			<module id="add" type="shortcut"  />
		</layer>
		<layer id="bottleneck-3-1" desc="output:52*52*64, bottleneck-3(1/2), t=6, stride=2" >
			<!--1x1+leaky-->
			<module id="conv1x1" type="conv"  filters="192" />			
			<module id="norm1" type="batch-norm"  />
			<module id="leaky.1" type="activation" method="leaky"  />
			<!--3x3dw+leaky-->
			<module id="conv3x3dw" type="conv"  filters="192" size="3" group="192" stride="2" />
			<module id="norm2" type="batch-norm"  />
			<module id="leaky.2" type="activation" method="leaky"  />
			<!--1x1-->
			<module id="conv-transform" type="conv"  filters="64" />			
			<module id="norm3" type="batch-norm"  />
		</layer>
		<layer id="bottleneck-3-2" desc="output:52*52*64, bottleneck-3(2/2), t=6, stride=1" >
			<!--1x1+leaky-->
			<module id="conv1x1" type="conv"  filters="384" />			
			<module id="norm1" type="batch-norm"  />
			<module id="leaky.1" type="activation" method="leaky"  />
			<!--3x3dw+leaky-->
			<module id="conv3x3dw" type="conv"  filters="384" size="3" group="384" />
			<module id="norm2" type="batch-norm"  />
			<module id="leaky.2" type="activation" method="leaky"  />
			<!--1x1-->
			<module id="conv-transform" type="conv"  filters="64" />			
			<module id="norm3" type="batch-norm"  /> 
		</layer> 
		<layer id="bottleneck-4-1" desc="output:26*26*96, bottleneck-4(1/3), t=6, stride=2" >
			<!--1x1+leaky-->
			<module id="conv1x1" type="conv"  filters="384" />			
			<module id="norm1" type="batch-norm"  />
			<module id="leaky.1" type="activation" method="leaky"  />
			<!--3x3dw+leaky-->
			<module id="conv3x3dw" type="conv"  filters="384" size="3" group="384" stride="2" />
			<module id="norm2" type="batch-norm"  />
			<module id="leaky.2" type="activation" method="leaky"  />
			<!--1x1-->
			<module id="conv-transform" type="conv"  filters="96" />			
			<module id="norm3" type="batch-norm"  />
		</layer>
		<layer id="bottleneck-4-2" desc="output:26*26*96, bottleneck-4(2/3), t=6, stride=1" >
			<!--1x1+leaky-->
			<module id="conv1x1" type="conv"  filters="576" />			
			<module id="norm1" type="batch-norm"  />
			<module id="leaky.1" type="activation" method="leaky"  />
			<!--3x3dw+leaky-->
			<module id="conv3x3dw" type="conv"  filters="576" size="3" group="576" />
			<module id="norm2" type="batch-norm"  />
			<module id="leaky.2" type="activation" method="leaky"  />
			<!--1x1-->
			<module id="conv-transform" type="conv"  filters="96" />			
			<module id="norm3" type="batch-norm"  />
		</layer>
		<layer id="bottleneck-4-3" desc="output:26*26*96, bottleneck-4(3/3), t=6, stride=1" >
			<!--1x1+leaky-->
			<module id="conv1x1" type="conv"  filters="576" />			
			<module id="norm1" type="batch-norm"  />
			<module id="leaky.1" type="activation" method="leaky"  />
			<!--3x3dw+leaky-->
			<module id="conv3x3dw" type="conv"  filters="576" size="3" group="576" />
			<module id="norm2" type="batch-norm"  />
			<module id="leaky.2" type="activation" method="leaky"  />
			<!--1x1-->
			<module id="conv-transform" type="conv"  filters="96" />			
			<module id="norm3" type="batch-norm"  />
		</layer>		
		<layer id="bottleneck-6-1" desc="output:13*13*160,  bottleneck-6(1/3), t=6, stride=2" >
			<!--1x1+leaky-->
			<module id="conv1x1" type="conv"  filters="576" />			
			<module id="norm1" type="batch-norm"  />
			<module id="leaky.1" type="activation" method="leaky"  />
			<!--3x3dw+leaky-->
			<module id="conv3x3dw" type="conv"  filters="576" size="3" group="576" stride="2" />
			<module id="norm2" type="batch-norm"  />
			<module id="leaky.2" type="activation" method="leaky"  />
			<!--1x1-->
			<module id="conv-transform" type="conv"  filters="160" />			
			<module id="norm3" type="batch-norm"  /> 
		</layer>
		<layer id="bottleneck-6-2" desc="output:13*13*160,  bottleneck-6(2/3), t=6, stride=1" >
			<!--1x1+leaky-->
			<module id="conv1x1" type="conv"  filters="960" />			
			<module id="norm1" type="batch-norm"  />
			<module id="leaky.1" type="activation" method="leaky"  />
			<!--3x3dw+leaky-->
			<module id="conv3x3dw" type="conv"  filters="960" size="3" group="960" />
			<module id="norm2" type="batch-norm"  />
			<module id="leaky.2" type="activation" method="leaky"  />
			<!--1x1-->
			<module id="conv-transform" type="conv"  filters="160" />			
			<module id="norm3" type="batch-norm"  /> 
		</layer>
		<layer id="bottleneck-6-3" desc="output:13*13*160,  bottleneck-6(3/3), t=6, stride=1" >
			<!--1x1+leaky-->
			<module id="conv1x1" type="conv"  filters="960" />			
			<module id="norm1" type="batch-norm"  />
			<module id="leaky.1" type="activation" method="leaky"  />
			<!--3x3dw+leaky-->
			<module id="conv3x3dw" type="conv"  filters="960" size="3" group="960" />
			<module id="norm2" type="batch-norm"  />
			<module id="leaky.2" type="activation" method="leaky"  />
			<!--1x1-->
			<module id="conv-transform" type="conv"  filters="320" />			
			<module id="norm3" type="batch-norm"  /> 
		</layer> 
		<layer id="conv2d-32">
			<module id="convolution"  type="conv" filters="15"  bias="true" /> 
		</layer>
		<layer id="detection-32">
			<module id="yolo" type="yolo-detection"  anchor-masks="3,4,5" />
		</layer>
		<layer id="bottleneck-8">
			<!--1x1+leaky-->
			<module id="conv1x1" type="conv"  filters="160" before="bottleneck-6-2.norm3"/>			
			<module id="norm1" type="batch-norm"  />
			<module id="leaky.1" type="activation" method="leaky"  />
			<!--3x3dw+leaky-->
			<module id="conv3x3dw" type="conv"  filters="160" size="3" group="160" />
			<module id="norm2" type="batch-norm"  />
			<module id="leaky.2" type="activation" method="leaky"  />
			<!--1x1-->
			<module id="conv-transform" type="conv"  filters="160" />			
			<module id="norm3" type="batch-norm"  />
		</layer>
		<layer id="upsample">
			<module id="upsample" type="upsample"  stride="2"   />
		</layer>
		<layer id="concat">
			<module  type="conv"  id="convolution" filters="32" size="3" before="upsample.upsample,bottleneck-4-3.norm3"/>
			<module id="normalization" type="batch-norm"  />
			<module id="activation" type="activation" method="leaky"  />
		</layer>
		<layer id="conv2d-16">
			<module  type="conv"  id="convolution" filters="15" bias="true" /> 
		</layer>
		<layer id="detection-16">
			<module id="yolo" type="yolo-detection"  anchor-masks="0,1,2"  />
		</layer>
	</layers>
</net>
