<?xml version="1.0" encoding="utf-8"?>
<net version="1.0">
	<input>
		<data_order>NCHW</data_order>
		<data_type>FP32</data_type>
		<channels>3</channels>
		<height>416</height>
		<width>416</width>
	</input>	
	<classes>
		<class>areca</class>		
	</classes> 
	<anchors style="yolo">
		<anchor width="10" height="14" />
		<anchor width="27" height="23" />
		<anchor width="37" height="58" />
		<anchor width="75" height="67" />
		<anchor width="93" height="104" />
		<anchor width="187" height="163" />
	</anchors>
	<layers> 
		<layer id="stage-0101" desc="16 channels, kernel size 3x3, stride:2">
			<module type="conv" id="convolution" filters="16" size="3" stride="2" before="none"/>
			<module type="batch-norm" id="normalization" before="convolution" />
			<module type="activation" id="activation" method="relu6" before="normalization" />
		</layer>
		<layer id="stage-0201" desc="32 channels, kernel size 3x3, stride:2">
			<module type="conv" id="convolution" filters="32" size="3" stride="2" before="stage-0101.activation"/>
			<module type="batch-norm" id="normalization" before="convolution" />
			<module type="activation" id="activation" method="relu6" before="normalization" />
		</layer>
		<layer id="stage-0401" desc="64 channels, kernel size 3x3, stride:2">
			<module type="conv" id="convolution" filters="64" size="3" stride="2" before="stage-0201.activation"/>
			<module type="batch-norm" id="normalization" before="convolution" />
			<module type="activation" id="activation" method="relu6" before="normalization" />z
		</layer>
		<layer id="stage-0801" desc="128 channels, kernel size 3x3, stride:2">
			<module type="conv" id="convolution" filters="128" size="3" stride="2" before="stage-0401.activation"/>
			<module type="batch-norm" id="normalization" before="convolution" />
			<module type="activation" id="activation" method="relu6" before="normalization" />
		</layer>
		<layer id="stage-1601" desc="256 channels, kernel size 3x3, stride:2">
			<module type="conv" id="convolution" filters="256" size="3" stride="2" before="stage-0801.activation"/>
			<module type="batch-norm" id="normalization" before="convolution" />
			<module type="activation" id="activation" method="relu6" before="normalization" />
		</layer> 
		<!-- 完成32的downsample -->
		<layer id="stage-3201" desc="512 channels, kernel size 3x3, stride:1">
			<module type="conv" id="convolution" filters="512" size="3"  before="stage-1601.activation"/>
			<module type="batch-norm" id="normalization" before="convolution" />
			<module type="activation" id="activation" method="relu6" before="normalization" />
		</layer>
		<layer id="stage-3202" desc="256 channels, kernel size 1x1, stride:1">
			<module type="conv" id="convolution" filters="256" size="1" stride="1" before="stage-3201.activation"/>
			<module type="batch-norm" id="normalization" before="convolution" />
			<module type="activation" id="activation" method="relu6" before="normalization" />
		</layer> 
		<layer id="beforedet32">
			<module type="conv" id="convolution" filters="15" size="1" stride="1" bias="true" before="stage-3202.activation"/> 
		</layer>
		<layer id="detect-32">
			<module type="yolo-detection" id="yolo" before="beforedet32.convolution" anchor-masks="3,4,5" />
		</layer>
		<layer id="stage-32br">
			<module type="conv" id="convolution" filters="128" size="1" stride="1" before="stage-3201.activation"/>
			<module type="batch-norm" id="normalization" before="convolution" />
			<module type="activation" id="activation" method="relu6" before="normalization" />
		</layer>
		<layer id="stage-32up">
			<module type="upsample" id="upsample" stride="2" before="stage-32br.activation" />
		</layer>
		<layer id="stage-16merge">
			<module type="conv" id="convolution" filters="256" size="3" before="stage-32up.upsample,stage-0801.activation"/>
			<module type="batch-norm" id="normalization" before="convolution" />
			<module type="activation" id="activation" method="relu6" before="normalization" />
		</layer>
		<layer id="beforedet16">
			<module type="conv" id="convolution" filters="15" size="1" bias="true" before="stage-16merge.activation"/> 
		</layer>
		<layer id="detect-16">
			<module id="yolo" type="yolo-detection" before="beforedet16.convolution" anchor-masks="0,1,2"  />
		</layer>
	</layers>
</net>
